app/controllers/billboards_controller.rb

SELECT "billboards".* FROM "billboards"
---
  def index
    @billboards = Billboard.all

INSERT INTO "billboards" ("category", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["category", "Top 100 US"], ["created_at", "2019-03-07 05:44:04.849844"], ["updated_at", "2019-03-07 05:44:04.849844"]]
---
  def create
    @billboard = Billboard.new(billboard_params)

    respond_to do |format|
      if @billboard.save

UPDATE "billboards" SET "category" = $1, "updated_at" = $2 WHERE "billboards"."id" = $3  [["category", "Top 100 USA"], ["updated_at", "2019-03-07 05:49:49.409299"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @billboard.update(billboard_params)

SELECT  "billboards".* FROM "billboards" WHERE "billboards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_billboard
      @billboard = Billboard.find(params[:id])